---
kind: property
id: P:Autodesk.Revit.DB.Events.DocumentSavingAsEventArgs.IsSavingAsCentralFile
source: html/62eadeaf-dc0d-c1ae-75b8-c4c3beb8c108.htm
---
# Autodesk.Revit.DB.Events.DocumentSavingAsEventArgs.IsSavingAsCentralFile Property

Indicates whether the document is to be saved as central file.

## Syntax (C#)
```csharp
public bool IsSavingAsCentralFile { get; }
```